4/code/param/run_3_10000_050_01/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     icoFoam;

startFrom       latestTime;

startTime       0;

stopAt          endTime;

// make sure to modify the 3 entries below before
// attempting to execute any OpenFOAM utility.
// See README for details

endTime         60.0;
deltaT          0.0026666666666666666;
writeInterval   0.1;

writeControl    runTime;

purgeWrite      0;

writeFormat     ascii;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable true;

adjustTimeStep yes;

maxCo 0.2;

maxDeltaT 1;

// ************************************************************************* //

// functions 
// { 
//     #includeFunc  probes 
//     #includeFunc  singleGraph 
//     #includeFunc  forces 
//     #includeFunc  forceCoeffs 
// }
